app/Controllers/Login.php

    public function process()
    {
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');
        $dataUser = $this->UserModel->where([
            'user_username' => $username,
        ])->first();
---
SELECT *
FROM `user`
WHERE `user_username` = 'admin'
 LIMIT 1