app/Controllers/Transaksi.php

SELECT `tbl_transaksi`.*, `u`.`user_username`
FROM `tbl_transaksi`
JOIN `user` `u` ON `tbl_transaksi`.`user_id` = `u`.`user_id`
WHERE `transaksi_id` = '1188'
 LIMIT 1
SELECT *
FROM `tbl_transaksi_detail`
JOIN `barang_stock` `sb` ON `tbl_transaksi_detail`.`bstock_id` = `sb`.`bstock_id`
WHERE `transaksi_id` = '1188'
---
    public function cetak_no_print($id)
    {

        // $id = $this->request->getPostGet('id');
        $penjualan = $this->penjualan->select('tbl_transaksi.*,u.user_username')->join('user u', 'tbl_transaksi.user_id = u.user_id')->where('transaksi_id', $id)->first();

        $transaksi_detail = $this->penjualanDetail->select('*')->join('barang_stock sb', 'tbl_transaksi_detail.bstock_id = sb.bstock_id')->where('transaksi_id', $id)->findAll();